<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Pivot-Tables" data-toc-modified-id="Pivot-Tables-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Pivot Tables</a></span></li></ul></div>

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# pivot/unpivot

In [8]:
df = pd.read_csv('data/life_expectancy_years.csv')

In [9]:
df.head()

,country,1800,1801,1802,1803,1804,1805,1806,1807,1808,...,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018
0,Afghanistan,"28,2","28,2","28,2","28,2","28,2","28,2","28,1","28,1","28,1",...,"55,7","56,2","56,7","57,2","57,7","57,8","57,9",58,"58,4","58,7"
1,Albania,"35,4","35,4","35,4","35,4","35,4","35,4","35,4","35,4","35,4",...,"75,9","76,3","76,7",77,"77,2","77,4","77,6","77,7","77,9",78
2,Algeria,"28,8","28,8","28,8","28,8","28,8","28,8","28,8","28,8","28,8",...,"76,3","76,5","76,7","76,8",77,"77,1","77,3","77,4","77,6","77,9"
3,Angola,27,27,27,27,27,27,27,27,27,...,"59,3","60,1","60,9","61,7","62,5","63,3",64,"64,7","64,9","65,2"
4,Antigua and Barbuda,"33,5","33,5","33,5","33,5","33,5","33,5","33,5","33,5","33,5",...,"76,9","76,8","76,9",77,"77,3","77,1","77,2","77,3","77,4","77,6"

In [ ]:
# explore data

In [47]:
# melt the normalized file, hold the country name and code variables, rename the melted columns
# id_vars, var_name, value_name

In [12]:
df2.head()

               country  year life_expectancy
0          Afghanistan  1800            28,2
1              Albania  1800            35,4
2              Algeria  1800            28,8
3               Angola  1800              27
4  Antigua and Barbuda  1800            33,5

In [ ]:
# pivot the data by years
# index, columns, values

year,1800,1801,1802,1803,1804,1805,1806,1807,1808,1809,...,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018
country,,,,,,,,,,,,,,,,,,,,,
Afghanistan,"28,2","28,2","28,2","28,2","28,2","28,2","28,1","28,1","28,1","28,1",...,"55,7","56,2","56,7","57,2","57,7","57,8","57,9",58,"58,4","58,7"
Albania,"35,4","35,4","35,4","35,4","35,4","35,4","35,4","35,4","35,4","35,4",...,"75,9","76,3","76,7",77,"77,2","77,4","77,6","77,7","77,9",78
Algeria,"28,8","28,8","28,8","28,8","28,8","28,8","28,8","28,8","28,8","28,8",...,"76,3","76,5","76,7","76,8",77,"77,1","77,3","77,4","77,6","77,9"
Angola,27,27,27,27,27,27,27,27,27,27,...,"59,3","60,1","60,9","61,7","62,5","63,3",64,"64,7","64,9","65,2"
Antigua and Barbuda,"33,5","33,5","33,5","33,5","33,5","33,5","33,5","33,5","33,5","33,5",...,"76,9","76,8","76,9",77,"77,3","77,1","77,2","77,3","77,4","77,6"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Venezuela,"32,2","32,2","32,2","32,2","32,2","32,2","32,2","32,2","32,2","32,2",...,75,"75,4","75,4","75,3","75,4","75,5","75,5","75,5","75,7","75,9"
Vietnam,32,32,32,32,32,32,32,32,32,32,...,"72,8","73,1","73,3","73,6","73,8","74,1","74,3","74,5","74,7","74,9"
Yemen,"23,4","23,4","23,4","23,4","23,4","23,4","23,4","23,4","23,4","23,4",...,67,"67,5","67,7","67,9","68,4","68,4","67,2","66,7","66,9","67,1"
Zambia,"32,6","32,6","32,6","32,6","32,6","32,6","32,6","32,6","32,6","32,6",...,"50,7",52,"53,2","54,5","55,7",57,"58,1","58,8","59,1","59,5"
Zimbabwe,"33,7","33,7","33,7","33,7","33,7","33,7","33,7","33,7","33,7","33,7",...,"47,5","49,6","51,9","54,1","55,6",57,"58,3","59,3","59,8","60,2"

# Exercise

Build a dataframe with numeric exam marks for the following subjects and find out the student with more A's

- A: 9-10
- B: 7-8
- C: 5-6
- D: 0-4

In [28]:
subjects = ['history', 'english', 'math', 'biology', 'physics', 'chemistry']

In [29]:
# create dataframe
notas = pd.DataFrame(np.random.randint(3, 10, (20,6)))
notas.columns = subjects
notas['student'] = notas.index

In [30]:
notas.head()

   history  english  math  biology  physics  chemistry  student
0        8        7     3        3        9          4        0
1        5        5     6        9        4          6        1
2        5        6     9        8        3          5        2
3        6        5     4        5        3          8        3
4        7        5     4        8        4          5        4

In [33]:
# melt (id_vars, var_name, value_name)

   student  subject  mark
0        0  history     8
1        1  history     5
2        2  history     5
3        3  history     6
4        4  history     7

In [34]:
# cut
notas['calification'] =

In [35]:
notas.head()

   student  subject  mark calification
0        0  history     8            B
1        1  history     5            C
2        2  history     5            C
3        3  history     6            C
4        4  history     7            B

In [39]:
# pivot index, columns, values, aggfunc, fill_value, sort

calification  D  C  B  A
student
12            1  3  0  2
0             3  0  2  1
8             2  2  1  1
18            2  0  3  1
17            1  1  3  1
13            1  3  1  1
11            1  2  2  1
1             1  4  0  1
19            1  3  1  1
2             1  3  1  1
9             1  4  1  0
7             2  1  3  0
6             5  1  0  0
5             3  2  1  0
4             2  2  2  0
14            3  2  1  0
15            2  2  2  0
16            0  4  2  0
3             2  3  1  0
10            1  1  4  0